@cls
@set path="c:\tcc"

@cd "Ввод\Windows"
@start /WAIT обновить.bat
@cd ../../

@cd "Вывод\Windows"
@start /WAIT обновить.bat
@cd ../../

@cd "Расширения языка C\Windows"
@start /WAIT обновить.bat
@cd ../../

@cls
@echo [--------------------------------------------------]

@copy "windows.h" "%path%\include\windows.h"
@copy "x86 32 bit.h" "%path%\include\x86 32 bit.h"

@cls
@echo [##########----------------------------------------]

@cd "Структуры данных\Буфер\Windows"
@start /WAIT обновить.bat
@cd ../../../

@cd "Структуры данных\Двухсвязный список\Windows"
@start /WAIT обновить.bat
@cd ../../../

@cd "Структуры данных\Массив с добавлением в конец\Windows"
@start /WAIT обновить.bat
@cd ../../../

@cd "Структуры данных\Очередь\Windows"
@start /WAIT обновить.bat
@cd ../../../

@cd "Структуры данных\Префиксное дерево\Windows"
@start /WAIT обновить.bat
@cd ../../../

@cd "Структуры данных\Символ\Windows"
@start /WAIT обновить.bat
@cd ../../../

@cd "Структуры данных\Строка\Windows"
@start /WAIT обновить.bat
@cd ../../../

@cd "Структуры данных\Структура с произвольным доступом\Windows"
@start /WAIT обновить.bat
@cd ../../../

@cls
@echo [########################--------------------------]

@cd "Главная система\Интерфейсы\Загрузчик динамических библиотек\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Интерфейсы\Потоки выполнения\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Интерфейсы\Файлы\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Интерфейсы\Память\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Интерфейсы\Отладка\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cls
@echo [#######################################-----------]

@cd "Главная система\Устройства\Графика\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Устройства\Графика\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Устройства\Звук\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Устройства\Клавиатура\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Устройства\Мышь\Windows"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Главная система\Устройства\Сеть\Информация о сети\Windows"
@start /WAIT обновить.bat
@cd ../../../../../

@cd "Главная система\Устройства\Сеть\Подключение к сети\TCP\Windows"
@start /WAIT обновить.bat
@cd ../../../../../../

@cd "Главная система\Устройства\Сеть\Сетевой сервер\TCP\Windows"
@start /WAIT обновить.bat
@cd ../../../../../../

@cls
@echo [#########################################---------]

@cd "Взаимодействие с человеком\Графика\Холст\Windows\"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Взаимодействие с человеком\Графика\2D\Фигуры\Windows\"
@start /WAIT обновить.bat
@cd ../../../../../

@cd "Взаимодействие с человеком\Графика\2D\Манипуляторы\События\Windows\"
@start /WAIT обновить.bat
@cd ../../../../../../

@cd "Взаимодействие с человеком\Графика\2D\Шрифт\Растровый шрифт\Windows\"
@start /WAIT обновить.bat
@cd ../../../../../../

@cd "Взаимодействие с человеком\Графика\2D\Шрифт\Векторный шрифт\Стандарт\Windows\"
@start /WAIT обновить.bat
@cd ../../../../../../../

@cls
@echo [#############################################-----]

@cd "Математика\Геометрия\Точка\Windows\"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Математика\Геометрия\Вектор\Windows\"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Математика\Геометрия\Кривая\Windows\"
@start /WAIT обновить.bat
@cd ../../../../

@cd "Математика\Комбинаторика\Windows\"
@start /WAIT обновить.bat
@cd ../../../

@cls
@echo [##################################################]